latex/how-to.org
#+title: how to
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* force pagebreak

#+BEGIN_SRC org
  ,#+LATEX: \pagebreak
#+END_SRC

* page numbering x of x

#+BEGIN_SRC org
  ,#+LATEX_HEADER: \usepackage{lastpage}
  ,#+LATEX_HEADER: \usepackage{fancyhdr}
  ,#+LATEX_HEADER: \pagestyle{fancy}
  ,#+LATEX_HEADER: \cfoot{\thepage\ of \pageref{LastPage}}
#+END_SRC

* stop block being split over a page

#+BEGIN_SRC org
  ,#+LATEX: \begin{samepage}
  ,#+LATEX: \end{samepage}
#+END_SRC

* input/ include files

#+BEGIN_SRC tex
  % input command
  \input{filename}

  % include command
  \include{filename}  % starts a new page
#+END_SRC

* print the value of a variable

#+BEGIN_SRC tex
  \typeout{The text height is \the\textheight}
#+END_SRC

[[./latex.html][back]]
