latex/how-to.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>how to</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">how to</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c4fd06">force pagebreak</a></li>
<li><a href="#org5e1bdc6">page numbering x of x</a></li>
<li><a href="#org65fb198">stop block being split over a page</a></li>
<li><a href="#orgaed2e8d">input/ include files</a></li>
<li><a href="#org2238c21">print the value of a variable</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5c4fd06" class="outline-2">
<h2 id="org5c4fd06">force pagebreak</h2>
<div class="outline-text-2" id="text-org5c4fd06">
<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+LATEX: \pagebreak</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e1bdc6" class="outline-2">
<h2 id="org5e1bdc6">page numbering x of x</h2>
<div class="outline-text-2" id="text-org5e1bdc6">
<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+LATEX_HEADER: \usepackage{lastpage}</span>
<span style="color: #b22222;">#+LATEX_HEADER: \usepackage{fancyhdr}</span>
<span style="color: #b22222;">#+LATEX_HEADER: \pagestyle{fancy}</span>
<span style="color: #b22222;">#+LATEX_HEADER: \cfoot{\thepage\ of \pageref{LastPage}}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org65fb198" class="outline-2">
<h2 id="org65fb198">stop block being split over a page</h2>
<div class="outline-text-2" id="text-org65fb198">
<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+LATEX: \begin{samepage}</span>
<span style="color: #b22222;">#+LATEX: \end{samepage}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaed2e8d" class="outline-2">
<h2 id="orgaed2e8d">input/ include files</h2>
<div class="outline-text-2" id="text-orgaed2e8d">
<div class="org-src-container">
<pre class="src src-tex"><span style="color: #b22222;">% </span><span style="color: #b22222;">input command</span>
<span style="color: #a020f0;">\input</span>{<span style="color: #008b8b;">filename</span>}

<span style="color: #b22222;">% </span><span style="color: #b22222;">include command</span>
<span style="color: #ff0000; font-weight: bold;">\include</span>{<span style="color: #008b8b;">filename</span>}  <span style="color: #b22222;">% starts a new page</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2238c21" class="outline-2">
<h2 id="org2238c21">print the value of a variable</h2>
<div class="outline-text-2" id="text-org2238c21">
<div class="org-src-container">
<pre class="src src-tex"><span style="color: #696969;">\typeout</span>{The text height is <span style="color: #696969;">\the\textheight</span>}
</pre>
</div>

<p>
<a href="./latex.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
